### Decision trees

Decision trees are a popular machine learning algorithm that can be used for both regression and classification tasks. They are easy to understand, interpret, and implement, making them an ideal choice for beginners in the field of machine learning.

In [1]:
import pandas as pd
df = pd.read_csv("salaries.csv")
df

       company                  job     degree  salary_more_than_100k
0       google      sales executive  bachelors                      0
1       google      sales executive    masters                      0
2       google     business manager  bachelors                      1
3       google     business manager    masters                      1
4       google  computer programmer  bachelors                      0
5       google  computer programmer    masters                      1
6   abc pharma      sales executive    masters                      0
7   abc pharma  computer programmer  bachelors                      0
8   abc pharma     business manager  bachelors                      0
9   abc pharma     business manager    masters                      1
10    facebook      sales executive  bachelors                      1
11    facebook      sales executive    masters                      1
12    facebook     business manager  bachelors                      1
13    facebook     business manager    masters                      1
14    facebook  computer programmer  bachelors                      1
15    facebook  computer programmer    masters                      1

In [4]:
inputs = df.drop("salary_more_than_100k", axis="columns") # independent variables
target = df["salary_more_than_100k"] #dependent variables

In [7]:
target

0     0
1     0
2     1
3     1
4     0
5     1
6     0
7     0
8     0
9     1
10    1
11    1
12    1
13    1
14    1
15    1
Name: salary_more_than_100k, dtype: int64

In [5]:
# Converting categorical columns into numeric colums
from sklearn.preprocessing import LabelEncoder

In [6]:
# creating three objects for the three labels
le = LabelEncoder()

In [9]:
inputs["company_n"] = le.fit_transform(inputs["company"])
inputs["job_n"] = le.fit_transform(inputs["job"])
inputs["degree_n"] = le.fit_transform(inputs["degree"])
inputs.tail()

     company                  job     degree  company_n  job_n  degree_n
11  facebook      sales executive    masters          1      2         1
12  facebook     business manager  bachelors          1      0         0
13  facebook     business manager    masters          1      0         1
14  facebook  computer programmer  bachelors          1      1         0
15  facebook  computer programmer    masters          1      1         1

In [11]:
inputs_n = inputs.drop(["company", "job", "degree"], axis="columns")
inputs_n

    company_n  job_n  degree_n
0           2      2         0
1           2      2         1
2           2      0         0
3           2      0         1
4           2      1         0
5           2      1         1
6           0      2         1
7           0      1         0
8           0      0         0
9           0      0         1
10          1      2         0
11          1      2         1
12          1      0         0
13          1      0         1
14          1      1         0
15          1      1         1

In [12]:
from sklearn.model_selection import train_test_split
X_train, X_test, y_train, y_test = train_test_split(inputs_n, target, test_size=0.2, random_state=42)

In [13]:
from sklearn import tree

In [14]:
model = tree.DecisionTreeClassifier()

In [15]:
model.fit(X_train, y_train)

DecisionTreeClassifier()

In [16]:
model.predict(X_test)

array([0, 1], dtype=int64)

In [17]:
X_test

   company_n  job_n  degree_n
0          2      2         0
1          2      2         1

In [18]:
inputs.head()

  company                  job     degree  company_n  job_n  degree_n
0  google      sales executive  bachelors          2      2         0
1  google      sales executive    masters          2      2         1
2  google     business manager  bachelors          2      0         0
3  google     business manager    masters          2      0         1
4  google  computer programmer  bachelors          2      1         0

In [19]:
model.score(X_test, y_test)

0.5

In [20]:
model.predict([[2, 2, 1]])

array([1], dtype=int64)

In [21]:
model.predict([[2,0, 1]])

array([1], dtype=int64)